Revit 2026 API

# IFCDataAsAggregate Method

---

Gets storage value as IFCAggregate when its PrimitiveType is aggregate.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAggregate AsAggregate()
```
```vb
Public Function AsAggregate As IFCAggregate
```
```cpp
public:
IFCAggregate^ AsAggregate()
```
```fsharp
member AsAggregate : unit -> IFCAggregate
```

#### Return Value

IFCAggregate The IFCAggregate.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not aggregate. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace